-- part 1: Joyo official 新字体 - 旧字体
-- part 2: Joyo kyujitai unlisted 新字体 - 旧字体
-- part 3: Joyo extended 拡張新字体 - 常用漢字字体
-- part 4: Jimeyo official 新字体 - 旧字体
-- part 5: Jimeyo kyujitai unlisted 新字体 - 旧字体
-- part 6: Hyogai 簡易慣用字体 - 印刷標準字体
-- part 7: Hyogai kyujitai unlisted 印刷標準字体（新字体） - 旧字体
-- part 8: Hyogai extended 拡張新字体 - 印刷標準字体
-- part 9: Joyo 新字体 - 旧字体 (unsupported title)
-- part 10: Jimeyo 新字体 - 旧字体 (unsupported title)
return {[[
亜亞 悪惡 圧壓 囲圍 医醫 為爲 壱壹 隠隱 栄榮 営營
衛衞 駅驛 円圓 塩鹽 縁緣 艶艷 応應 欧歐 殴毆 桜櫻
奥奧 横橫 温溫 穏穩 仮假 価價 画畫 会會 絵繪 壊壞
懐懷 概槪 拡擴 殻殼 覚覺 学學 岳嶽 楽樂 渇渴 缶罐
巻卷 陥陷 勧勸 寛寬 関關 歓歡 観觀 気氣 帰歸 亀龜
偽僞 戯戲 犠犧 旧舊 拠據 挙擧 虚虛 峡峽 挟挾 狭狹
郷鄕 暁曉 区區 駆驅 勲勳 薫薰 径徑 茎莖 恵惠 掲揭
渓溪 経經 蛍螢 軽輕 継繼 鶏鷄 芸藝 撃擊 欠缺 研硏
県縣 倹儉 剣劍 険險 圏圈 検檢 献獻 権權 顕顯 験驗
厳嚴 戸戶 広廣 効效 恒恆 黄黃 鉱鑛 号號 国國 黒黑
済濟 斎齋 砕碎 剤劑 雑雜 参參 桟棧 蚕蠶 惨慘 賛贊
残殘 糸絲 歯齒 児兒 辞辭 湿濕 実實 写寫 釈釋 寿壽
収收 従從 渋澁 獣獸 縦縱 粛肅 処處 緒緖 叙敍 将將
称稱 渉涉 焼燒 証證 奨奬 条條 状狀 乗乘 浄淨 剰剩
畳疊 縄繩 壌壤 嬢孃 譲讓 醸釀 触觸 嘱囑 真眞 寝寢
慎愼 尽盡 図圖 粋粹 酔醉 穂穗 随隨 髄髓 枢樞 数數
瀬瀨 声聲 斉齊 静靜 窃竊 摂攝 専專 浅淺 戦戰 践踐
銭錢 潜潛 繊纖 禅禪 双雙 壮壯 争爭 荘莊 捜搜 挿插
巣巢 曽曾 痩瘦 装裝 総總 騒騷 増增 蔵藏 臓臟 即卽
属屬 続續 堕墮 対對 体體 帯帶 滞滯 台臺 滝瀧 択擇
沢澤 担擔 単單 胆膽 団團 断斷 弾彈 遅遲 痴癡 虫蟲
昼晝 鋳鑄 庁廳 徴徵 聴聽 鎮鎭 逓遞 鉄鐵 点點 転轉
伝傳 灯燈 当當 党黨 盗盜 稲稻 闘鬭 徳德 独獨 読讀
届屆 弐貳 悩惱 脳腦 覇霸 拝拜 廃廢 売賣 麦麥 発發
髪髮 抜拔 晩晚 蛮蠻 秘祕 浜濱 瓶甁 払拂 仏佛 併倂
並竝 餅餠 辺邊 変變 歩步 宝寶 豊豐 褒襃 翻飜 毎每
万萬 満滿 麺麵 黙默 弥彌 訳譯 薬藥 与與 予豫 余餘
誉譽 揺搖 様樣 謡謠 来來 頼賴 乱亂 覧覽 竜龍 両兩
猟獵 緑綠 涙淚 塁壘 礼禮 励勵 戻戾 霊靈 齢齡 暦曆
歴歷 恋戀 錬鍊 炉爐 労勞 郎郞 楼樓 録錄 湾灣

飲飮 鋭銳 閲閱 悦悅 顔顏 告吿 舎舍 尚尙 呉吳 娯娛
告吿 歳歲 産產 青靑 清淸 税稅 説說 絶絕 脱脫 内內
舗舖

剥剝 頬頰 填塡 篭籠

亘亙 凜凛 尭堯 巌巖 桧檜 槙槇 祢禰 祷禱 禄祿 穣穰 遥遙

聡聰 彦彥

唖啞 頴穎 鴎鷗 撹攪 麹麴 鹸鹼 噛嚙 繍繡 蒋蔣 醤醬 掻搔
祷禱 桝枡 屏屛 并幷 蝋蠟 沪濾 芦蘆 弯彎

讃讚

嘘噓 焔焰 躯軀 屡屢 莱萊 騨驒 蝉蟬 箪簞 掴摑 顛顚 涜瀆
嚢囊 溌潑 醗醱 繋繫 蛎蠣 竃竈 潅灌 諌諫 頚頸 賎賤 壷壺
砺礪 梼檮 涛濤 迩邇 蝿蠅 侭儘 薮藪 褝襌

逸&#xFA67; 謁&#xFA62; 禍&#xFA52; 悔&#xFA3D; 海&#xFA45;
慨&#xFA3E; 喝&#xFA36; 褐&#xFA60; 漢&#xFA47; 祈&#xFA4E;
既&#xFA42; 器&#xFA38; 響&#xFA69; 勤&#xFA34; 謹&#xFA63;
穀&#xFA54; 殺&#xF970; 祉&#xFA4D; 視&#xFA61; 社&#xFA4C;
者&#xFA5B; 煮&#xFA48; 臭&#xFA5C; 祝&#xFA51; 暑&#xFA43;
署&#xFA5A; 諸&#xFA22; 祥&#xFA1A; 神&#xFA19; 節&#xFA56;
祖&#xFA50; 僧&#xFA31; 層&#xFA3B; 憎&#xFA3F; 贈&#xFA65;
嘆&#xFA37; 著&#xFA5F; 懲&#xFA40; 塚&#xFA10; 都&#xFA26;
突&#xFA55; 難&#xFA68; 梅&#xFA44; 繁&#xFA59; 卑&#xFA35;
碑&#xFA4B; 賓&#xFA64; 頻&#xFA6A; 敏&#xFA41; 侮&#xFA30;
福&#xFA1B; 塀&#xFA39; 勉&#xFA33; 墨&#xFA3A; 免&#xFA32;
欄&#xF91D; 隆&#xF9DC; 虜&#xF936; 類&#xF9D0; 練&#xFA57;
朗&#xF929; 廊&#xF928;

渚&#xFA62; 猪&#xFA16; 琢&#xFA4A; 祐&#xFA4F; 禎&#xFA53;
]]}

-- ref part 1: Joyo 新字体 - 旧字体 (ambiguous)
--[[
highly ambiguous:
弁 弁辨瓣辯
other (variant character/very rare, treated as part 1):
缶 缶罐
既 &#64066;&#26083;
芸 芸藝
欠 欠缺
糸 糸絲
証 証證
体 体體
台 台臺
灯 灯燈
虫 虫蟲
闘 闘鬭
浜 浜濱
予 予豫
余 余餘
礼 &#xFA18;禮
缶 缶罐
既 &#64066;&#26083;
]]

-- ref part 2: Joyo "情報機器に搭載されている印刷文字字体の関係で"
--[[
餌・遡・遜・謎・餅・淫・葛・僅・煎・詮・嘲・捗・溺・塡・賭・剝・箸・蔽・頰
]]

-- ref part 3: unofficial or disputed (seen as variant forms rather than old forms)
--[[
Joyo:
*回囘 *却卻 *糾糺 *間閒 *強强 *教敎 *群羣 *携攜 *冴冱
*冊册 *床牀 *姉姊 *刃刄 *跡蹟 *窓窗 *勅敕 *妊姙 *粘黏
*姫姬 *没沒 *欲慾 *鎌鐮 *略畧 *隣鄰 *隷隸
*契&#xF909; *着&#xFA5F; *旅&#xF983; *廉&#xF9A2; *羽&#xFA1E;
*益&#xFA17; *館&#xFA2C; *飼&#xFA2B; *晴&#xFA12; *精&#xFA1D;
*飯&#xFA2A;
Jimeyo (not kyujitai):
**晃晄 **萌萠
Jimeyo (not listed):
***晋晉
Hyogai:
***瑶瑤
]]